test/src/test/testtool/EsbSoapWrapperPipe/41/out.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><MessageHeader xmlns="http://nn.nl/XSD/Generic/MessageHeader/2">
   <From>
      <Id>Ibis4Test</Id>
   </From>
   <To>
      <Location>MessagingLayer.BusinessDomain.ServiceLayer.ServiceName.ServiceVersion.OperationName.OperationVersion.Response</Location>
   </To>
   <HeaderFields>
      <CPAId>cpaid1</CPAId>
      <ConversationId>WPNLD9313348_0a4aba76-25fd2d45_13456bebc84_-7fd1</ConversationId>
      <MessageId>LPAB00000003980_0a4a9a9e-7ca9eef2_152f953bf59_-7fb5</MessageId>
      <CorrelationId>WPNLD9313348_0a4aba76-25fd2d45_13456bebc84_-7fd0</CorrelationId>
      <Timestamp>2016-02-19T12:40:37</Timestamp>
      <TransactionId>WPNLD9313348_0a4aba76-25fd2d45_13456bebc84_-7fd2</TransactionId>
   </HeaderFields>
   <Service>
      <Name>ServiceName</Name>
      <Context/>
      <Action>
         <Paradigm>Response</Paradigm>
         <Name>OperationName</Name>
         <Version>OperationVersion</Version>
      </Action>
   </Service>
</MessageHeader>
</soapenv:Header><soapenv:Body><CalculationRequest xmlns="http://www.frankframework.org/ISS/XSD/NL/LI/ActuarialCalculationsLifeRetail_1_CQAPVLI_1_Req_Rply">
      <SystemCode>L76HB000</SystemCode>
      <CalculationData>1:RS_INFO;835:ILIAS;645:ANP_VRH_3;</CalculationData>
      <Result xmlns="http://nn.nl/XSD/Generic/MessageHeader/2">
        <Status>OK</Status>
      </Result>
    </CalculationRequest>
</soapenv:Body></soapenv:Envelope>